'''
Уставшие от необычно теплой зимы, жители решили узнать, 
действительно ли это самая длинная оттепель за всю историю 
наблюдений за погодой. Они обратились к синоптикам, а те, в 
свою очередь, занялись исследованиями статистики за 
прошлые годы. Их интересует, сколько дней длилась самая 
длинная оттепель. Оттепелью они называют период, в 
который среднесуточная температура ежедневно превышала 
0 градусов Цельсия. Напишите программу, помогающую 
синоптикам в работе.
Пользователь вводит число N – общее количество
рассматриваемых дней (1 ≤ N ≤ 100). В следующих строках
располагается N целых чисел.
Каждое число – среднесуточная температура в
соответствующий день. Температуры – целые числа и лежат в
диапазоне от –50 до 50
Input: 6 -> -20 30 -40 50 10 -10
Output: 2
'''
'''
for i in range(n):
        coins.append(random.randint(0, 1))
'''

i
def Day_num_input(msg):
    xday = input(msg)
    return xday
    
def Temper(day_num, temerature):
    for i in range(int(day_num)):
        temerature.append(random.randint(-50, 50))
    for i in range(int(day_num)):
        if(int(temerature[i] > 0)):
            resultTemp += 1
        else:
            
        


day_num = Day_num_input("Введите количество дней")
temperature = list()
Temper
